gl.M.cho.O.U = {
  //js:['https://zam.usite.pro/db/Primery/1/minF/m.js'],
  //js:['/Подсказки/poleznoe/skorostJS/ok.js'],//Для тестирования localhost временноустановить!!!
  html: `
  <!-- <link href="https://zam.usite.pro/db/Primery/1/minF/m.css" rel="stylesheet"> -->
  <style>/* Корекция под окно: */
  #glPodskaz > *:last-child > * {/* Содержание окна */
    width: calc(100vw - 14px);/* На весь экран */
  }
  
  #glPodskaz table {
    width: 100%;
  }
  #glPodskaz caption {
    opacity:1
  }
  #glPodskaz table td:last-child {
    color: #777
  }
  #glPodskaz table td:last-child::first-letter {
    text-transform: uppercase;
  }
  </style>
  
  <div id="htmSpecS"></div>

  <script>
    gl.POD = {//Временная подгрузка скриптов из открытие страниц gl.cho. 'Подсказки'
      $: () => {
        $('#glPodskaz #htmSpecS').html(gl.POD.t())
      },
      a:[
        [ 'Пробелы, переносы',
          ['<i style="background:var(--bg)">&nbsp;</i>','#160','неразрывный пробел'],
          ['<i style="background:var(--bg)">&#8194;</i>','#8194','узкий пробел (еn-шириной в букву n)'],
          ['<i style="background:var(--bg)">&#8195;</i>','#8195','широкий пробел (em-шириной в букву m)'],
          ['#8211','#8211','узкое тире (en-тире)'],
          ['#8212','#8212','широкое тире (em-тире), широко используется в текстах'],
          ['<i style="background:var(--bg)">&#173;</i>','#173','мягкий перенос (хз что это)']
        ],
        [ 'Знаки арифметических и математических операций',
          ['lt', '#60', 'меньше, чем. Для html тега'],
          ['gt', '#62', 'больше, чем. Для html тега'],
          ['amp','#38','амперсанд'],
          ['times','times','крестик'],
          ['#215','#215','знак умножения'],
          ['divide','divide','#247;	знак деления'],
          ['plusmn','#177','знак «плюс/минус»'],
          ['sup1','#185','степень 1'],
          ['sup2','#178','степень 2'],
          ['sup3','#179','степень 3'],
          ['not','not','знак отрицания'],
          ['frac14','#188','одна четвертая'],
          ['frac12','#189','одна вторая'],
          ['frac34','#190','три четверти'],
          ['#8260','#8260','дробная черта'],
          ['#8722','#8722','знак минус'],
          ['#8804','#8804','меньше или равно'],
          ['#8805','#8805','больше или равно'],
          ['#8776','#8776','приблизительно равно (асимптотически равно)'],
          ['#8800','#8800','не равно'],
          ['#8801','#8801','совпадает с'],
          ['#8730','#8730','квадратный корень (радикал)'],
          ['#8734','#8734','знак бесконечность'],
          ['#8721','#8721','знак суммирования'],
          ['#8719','#8719','знак произведения'],
          ['#8706','#8706','частичный дифференциал'],
          ['#8747','#8747','интеграл']
        ],
        [ 'Кавычки',
          ['quot','#34','двойная кавычка'],
          ['laquo','#171','левая типографская кавычка (кавычка-елочка)'],
          ['raquo','#187','правая типографская кавычка (кавычка-елочка)'],
          ['#8242','#8242','штрих (минуты, футы)'],
          ['#8243','#8243','двойной штрих (секунды, дюймы)'],
          ['#8220','#8220','кавычка-лапка левая'],
          ['#8221','#8221','кавычка-лапка правая верхняя'],
          ['#8222','#8222','кавычка-лапка правая нижняя'],
          ['#8249','#8249','одинарная угловая кавычка открывающая'],
          ['#8250','#8250','одинарная угловая кавычка закрывающая'],
          ['#8216','#8216','левая верхняя одинарная кавычка'],
          ['#8217','#8217','правая верхняя одинарная кавычка'],
          ['#8218','#8218','правая нижняя одинарная кавычка']
        ],
        [ 'Полезные знаки',
          ['#44', '#x2c', 'Запитая. Название сущности: &amp;comma; (хотя этот вариант используется реже, но тоже верен)'],
          ['copy','#169','копирайт'],
          ['reg','#174','знак (r) — зарегистрировано'],
          ['ordm','#186','копье марса'],
          ['ordf','#170','зеркало венеры'],
          ['permil','#8240','промилле'],
          ['pi','#960','пи'],
          ['brvbar','brvbar','вертикальная черта'],
          ['sect','#167','знак параграфа'],
          ['deg','deg','знак градуса'],
          ['micro','#181','знак «микро»'],
          ['para','#182','знак абзаца'],
          ['middot','middot','точка-маркер'],
          ['#176','#176','градус'],
          ['#8230','#8230','многоточие'],
          ['#8254','#8254','надчеркивание (верхняя черта)'],
          ['#180','#180','знак ударения'],
          ['#166','#166','вертикальный пунктир'],
          ['#8470','#8470','знак/символ номера']
        ],
        [ 'Числа',
          ['#10102','#10102','номер 1'],
          ['#10103','#10103','номер 2'],
          ['#10104','#10104','номер 3'],
          ['#10105','#10105','номер 4'],
          ['#10106','#10106','номер 5'],
          ['#10107','#10107','номер 6'],
          ['#10108','#10108','номер 7, далее, по аналогии — #10109 будет числом 8']
        ],
        [ 'Знаки валют',
          ['euro','#8364','евро'],
          ['cent','#162','цент'],
          ['pound','#163','фунт'],
          ['curren','#164','знак валюты'],
          ['yen','#165','знак йены и юаня'],
          ['#402','#402','знак флорина']
        ],
        [ 'Стрелки',
          ['#8592','#8592','стрелка влево'],
          ['#8593','#8593','стрелка вверх'],
          ['#8594','#8594','стрелка вправо'],
          ['#8595','#8595','стрелка вниз'],
          ['#8596','#8596','стрелка влево и вправо'],
          ['#8656','#8656','двойная стрелка влево'],
          ['#8657','#8657','двойная стрелка вверх'],
          ['#8658','#8658','двойная стрелка вправо (следствие)'],
          ['#8659','#8659','двойная стрелка вниз'],
          ['#8660','#8660','двойная стрелка влево-вправо (туда-сюда)']
        ],
        [ 'Маркеры',
          ['#8226','#8226','простой маркер'],
          ['#183','#183','средняя точка'],
          ['#8224','#8224','крестик'],
          ['#8225','#8225','двойной крестик'],
          ['#9824','#9824','пики'],
          ['#9827','#9827','трефы'],
          ['#9829','#9829','червы'],
          ['#9830','#9830','бубны'],
          ['#9674','#9674','ромб']
        ]
      ],
      t: () => {
        let t = '';
        
        gl.POD.a.forEach(v => {
          t += '<table class="zTabC tab-0T">'+
            '<thead><tr>'+
              '<th>Пример</th>'+
              '<th>Символ</th>'+
              '<th>Код</th>'+
              '<th>Описание</th>'+
            '</tr></thead><tbody>';
          
          v.forEach((V, k) => {
            t += k?'<tr>'+
                '<th>'+(V[0][0]=='<'?V[0]:'&'+V[0]+';')+'</th>'+
                '<td>&amp;'+(V[0][0]=='<'?V[1]:V[0])+';</td>'+
                '<td>&amp;'+V[1]+';</td>'+
                '<td tdno><div style="--zHidH:2.5ex" zhid="1"><button zhidb><p><s></s></p></button>'+V[2]+'</div></td>'+
              '</tr>'
              :'<caption>'+V+'</caption>';
          });

          t += '</tbody></table>';
        });
        
        return t
      }
    };
    
    gl.POD.$();
    zHid.$();//Скрыть/Показать
    zTab.buf.$();//Установим на все <table class="zTabC". click по <td>(Скопировать)

  </script>
`};
